mov rax, 0x1111222233334444
mov eax, 0x55556666             ; rax = 0x0000000055556666
                                ; not rax = 0x1122334455556666
                                ; むしろ 0x11112222255556666 だと思ってた

mov rax, 0x1111222233334444     ; rax = 0x1111222233334444
mov ax, 0x7777                  ; rax = 0x1111222233337777

mov rax, 0x1111222233334444     ; rax = 0x1111222233334444
xor eax, eax                    ; rax = 0x0000000000000000
                                ; not rax = 0x1111222200000000

; raxとeaxなど、固定された物理的な実体としては存在していないらしい